Конфигурация/InformationRegisters/ОбесценениеАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОбесценениеАктивов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АктивДляОбесценения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДенежногоПотока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОбесценениеАктивов/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	ТекРегистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбесценениеАктивовСрезПоследних.Организация КАК Организация,
		|	ОбесценениеАктивовСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОбесценениеАктивовСрезПоследних.Актив КАК Актив,
		|	ОбесценениеАктивовСрезПоследних.ДатаДенежногоПотока КАК ДатаДенежногоПотока
		|ПОМЕСТИТЬ _ТекущиеКоэффициенты
		|ИЗ
		|	РегистрСведений.ОбесценениеАктивов.СрезПоследних(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОбесценениеАктивовСрезПоследних
		|ГДЕ
		|	ОбесценениеАктивовСрезПоследних.Коэффициент <> 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ТекущиеКоэффициенты.Организация, _ТекущиеКоэффициенты1.Организация) КАК Организация,
		|	ЕСТЬNULL(_ТекущиеКоэффициенты.СчетДоверительногоУправления, _ТекущиеКоэффициенты1.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_ТекущиеКоэффициенты.Актив, _ТекущиеКоэффициенты1.Актив) КАК Актив,
		|	_ТекущиеКоэффициенты1.ДатаДенежногоПотока КАК ДатаДенежногоПотока,
		|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(_ТекущиеКоэффициенты.Актив, _ТекущиеКоэффициенты1.Актив)) КАК АктивПредставление
		|ИЗ
		|	_ТекущиеКоэффициенты КАК _ТекущиеКоэффициенты
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ТекущиеКоэффициенты КАК _ТекущиеКоэффициенты1
		|		ПО _ТекущиеКоэффициенты.Организация = _ТекущиеКоэффициенты1.Организация
		|			И _ТекущиеКоэффициенты.СчетДоверительногоУправления = _ТекущиеКоэффициенты1.СчетДоверительногоУправления
		|			И _ТекущиеКоэффициенты.Актив = _ТекущиеКоэффициенты1.Актив
		|ГДЕ
		|	_ТекущиеКоэффициенты.ДатаДенежногоПотока = ДАТАВРЕМЯ(1, 1, 1)
		|	И _ТекущиеКоэффициенты1.ДатаДенежногоПотока <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ _ТекущиеКоэффициенты.ДатаДенежногоПотока ЕСТЬ NULL
		|	И НЕ _ТекущиеКоэффициенты1.ДатаДенежногоПотока ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ЭтотОбъект.Отбор.Регистратор.Значение.МоментВремени()));
	Запрос.УстановитьПараметр("Организация", ТекРегистратор.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ТекРегистратор.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для актива "+ ВыборкаДетальныеЗаписи.АктивПредставление+" не могут одновременно действовать два коэффициента: общий и на дату "+Формат(ВыборкаДетальныеЗаписи.ДатаДенежногоПотока, "ДФ=dd.MM.yyyy"),ТекРегистратор,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры
